package com.ssafy.algo;

import java.util.Scanner;

public class SW_1861_정사각형방_정답 {
	
	static int[][] map;
	static int N;
	static int roomNo = 0;
	static int moveCnt = 0;

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		
		int T = sc.nextInt();
		
		for (int t = 1; t <= T; t++) {  //test_case만큼 for문 돌리기 
			
			roomNo = Integer.MAX_VALUE; 
			moveCnt = 1;
			
			N = sc.nextInt(); 
			
			map = new int[N][N]; //N,N만큼 2차원 배열을 생성하기 
			
			for(int i = 0; i < N; i++) {
				for(int j = 0; j < N; j++) {  //for문 돌리면서 입력값 받기 
					
					map[i][j] = sc.nextInt();
				}
			}
			
			for(int i = 0; i < N; i++) { //완전탐색하면서 dfs하기 
				for(int j = 0; j < N; j++) {
					
					dfs(i, j, map[i][j], 1);
				}
			}
			
			System.out.println("#" + t + " " + roomNo + " " + moveCnt);
		}
		
		sc.close();
	}
	
	// 상-하-좌-우
	static int[] dy = {-1, 1, 0, 0};
	static int[] dx = { 0, 0,-1, 1};
		
		
	static void dfs( int y, int x, int origin, int count) {
		
		if( count > moveCnt ) {  
			
			moveCnt = count;
			roomNo = origin;
			
		}else if( count == moveCnt ) { //만약, count == moveCnt
			
			if( origin < roomNo ) roomNo = origin;
		}
		
		for (int i = 0; i < dy.length; i++) {
			
			int ny = y + dy[i];
			int nx = x + dx[i];
			//경계체크 및 값의 차이가 1일때에만 dfs실행 
			if( ny >= 0 && nx >= 0 && ny < N && nx < N  && map[ny][nx] == map[y][x] + 1 ) {
				dfs(ny, nx, origin, count + 1); //재귀하며 count+1을 한다. 
			}
		}
	}
}

/*
https://swexpertacademy.com/main/code/problem/problemDetail.do?contestProbId=AV5LtJYKDzsDFAXc
*/

/*
위에서 i번째 줄의 왼쪽에서 j번째 방에는 1이상 N^2 이하의 수 Ai,j가 적혀 있으며, 이 숫자는 모든 방에 대해 서로 다르다.
이동하려는 방에 적힌 숫자가 현재 방에 적힌 숫자보다 정확히 1 더 커야 한다.

이동할 수 있는 방의 개수가 최대인 방이 여럿이라면 그 중에서 적힌 수가 가장 작은 것을 출력한다.
*/

/*
일부
3
8
38 39 40 41 42 43 44 45 
46 47 48 49 50 51 52 53 
54 55 56 57 58 59 60 61 
62 63 64 1 2 3 4 5 
6 7 8 9 10 11 12 13 
14 15 16 17 18 19 20 21 
22 23 24 25 26 27 28 29 
30 31 32 33 34 35 36 37 
4
13 2 14 12 
10 16 6 5 
1 8 3 15 
7 11 4 9 
21
53 423 76 204 251 65 119 27 42 122 277 55 195 256 422 112 30 398 341 144 332 
381 32 19 264 56 286 300 401 213 342 238 135 68 91 161 345 280 416 102 75 392 
299 202 13 336 194 151 133 38 255 158 231 138 236 153 417 335 113 369 134 374 237 
263 80 44 294 377 99 21 1 273 162 327 233 436 252 291 404 104 430 421 433 437 
413 386 399 8 346 159 107 275 61 47 177 397 370 28 176 337 230 358 427 268 130 
424 141 4 408 292 174 200 250 221 324 79 160 311 308 334 396 143 126 90 179 258 
267 321 96 89 287 415 389 439 167 245 431 426 105 353 11 82 356 362 175 123 243 
239 425 40 106 152 16 328 7 272 2 246 136 365 137 241 281 298 70 379 34 293 
383 348 390 97 411 368 214 440 198 350 193 172 31 132 247 223 154 29 139 88 228 
288 432 351 95 312 414 15 261 227 12 265 319 285 186 269 52 58 5 352 235 309 
170 248 117 361 222 156 81 115 64 93 393 340 180 366 373 284 278 142 304 320 441 
23 318 171 376 354 212 17 60 290 148 110 419 74 403 147 405 124 310 114 391 39 
367 271 182 92 49 326 262 317 199 191 347 349 57 218 339 86 18 98 307 189 384 
303 313 125 87 201 51 24 163 270 325 224 207 25 6 282 120 77 279 338 190 306 
208 10 146 45 118 129 216 322 301 314 378 428 59 344 375 217 67 225 360 36 382 
197 364 412 145 438 372 406 363 380 78 429 181 165 400 296 128 330 435 140 100 407 
249 242 206 187 54 20 385 66 48 229 41 183 210 331 329 101 297 46 111 205 62 
420 359 395 253 295 69 155 103 72 333 84 244 215 388 121 323 150 305 73 357 394 
343 164 108 371 240 185 188 63 274 259 192 434 232 266 26 35 149 166 43 260 276 
168 33 289 226 85 410 315 196 409 22 302 203 116 50 71 316 219 211 402 37 83 
234 220 169 109 184 131 387 14 9 178 355 254 127 94 209 418 283 257 157 3 173 


#1 6 8
#2 3 2
#3 149 2
*/
