import java.util.*;
import java.util.Scanner;

public class Main_11_2 {
    public static void Main(int[][] money){
        int answer = -1;


    }
}
/* 삼촌이 조카 두 명에게 용돈을 나누어주려고 합니다. 두 명에게 나누어주는 용돈의 차이가 크면 조카들이 다툴 수 있으므로,
가능한 두 명이 받는 용돈의 차이를 최소로 하고 싶습니다
삼촌이 가지고 있는 화폐단위와 보유 수량을 담은 2차원 배열 money가 매개변수로 주어집니다.
 삼촌이 가지고 있는 모든 돈을 조카 두 명에게 최대한 공평하게 나누어 줄 때 , 둘이 받는
용돈 차이의 절대값을 return  하도록 solution  함수를 완성해주세요.

money의 길이는 1이상 100 이하입니다.
money의 원소는 [화폐단위, 보유 수량] 형식입니다.
     - 화폐 단위는 1이상 10,000 이하인 정수입니다.
     - 보유 수량은 1 이상 10 이하인 정수입니다.
     - 같은 화폐 단위가 담겨있지 않습니다.

     첫째, 100 =3개 주고 둘째, 200 = 1 , 50 = 2 -> 둘다 300원씩 갖게 됩니다.
     이 때 차이의 절대값은 0이며, 이것이 가장 공평하게

     첫째, 2500 = 2개 700원짜리 1개주면 총 5700원원
     첫째, 200 =1개 주고  700원짜리 4개 주면
     5300 원 이때의

 */